# ModelWithNoConditionedSpacesWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..ModelWithNoConditionedSpacesWarn Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
The model has no conditioned spaces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ModelWithNoConditionedSpacesWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelWithNoConditionedSpacesWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ModelWithNoConditionedSpacesWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace